debug-artifacts/load-tests/20260410T102719Z-authfix-smoke-eu-r3/eu-smoke-console.log
[k6] K6 version: k6 v0.53.0 (commit/f82a27da8f, go1.22.6, linux/amd64)
[k6] Pre-flight: checking https://35.244.162.92.nip.io/nginx-health ...
[k6] Results will be written to: json=debug-artifacts/load-tests/20260410T102719Z-authfix-smoke-eu-r3/eu-smoke-metrics.json

╔══════════════════════════════════════════════════╗
║         VCS K6 LOAD TEST RUNNER                ║
╚══════════════════════════════════════════════════╝

[k6] Scenario  : SMOKE
[k6] Target    : https://35.244.162.92.nip.io
[k6] Results   : /home/ajinkyataranekar26/distributed-vehicle-capacity-system/scripts/load-testing/results/summary-smoke-20260410T103722.json

[k6] Running: k6 run --out json=debug-artifacts/load-tests/20260410T102719Z-authfix-smoke-eu-r3/eu-smoke-metrics.json --summary-export /home/ajinkyataranekar26/distributed-vehicle-capacity-system/scripts/load-testing/results/summary-smoke-20260410T103722.json --env K6_SCENARIO=smoke --env BASE_URL=https://35.244.162.92.nip.io /home/ajinkyataranekar26/distributed-vehicle-capacity-system/scripts/load-testing/k6-load-test.js


          /\      |‾‾| /‾‾/   /‾‾/   
     /\  /  \     |  |/  /   /  /    
    /  \/    \    |     (   /   ‾‾\  
   /          \   |  |\  \ |  (‾)  | 
  / __________ \  |__| \__\ \_____/ .io

     execution: local
        script: /home/ajinkyataranekar26/distributed-vehicle-capacity-system/scripts/load-testing/k6-load-test.js
        output: json (debug-artifacts/load-tests/20260410T102719Z-authfix-smoke-eu-r3/eu-smoke-metrics.json)

     scenarios: (100.00%) 1 scenario, 1 max VUs, 1m0s max duration (incl. graceful stop):
              * smoke: 1 looping VUs for 30s (gracefulStop: 30s)

time="2026-04-10T10:37:22Z" level=info msg="\n============================================================" source=console
time="2026-04-10T10:37:22Z" level=info msg="VCS Load Test — Scenario: SMOKE" source=console
time="2026-04-10T10:37:22Z" level=info msg="Base URL: https://35.244.162.92.nip.io" source=console
time="2026-04-10T10:37:22Z" level=info msg="============================================================\n" source=console

running (0m01.0s), 1/1 VUs, 0 complete and 0 interrupted iterations
smoke   [   3% ] 1 VUs  01.0s/30s

running (0m02.0s), 1/1 VUs, 0 complete and 0 interrupted iterations
smoke   [   7% ] 1 VUs  02.0s/30s

running (0m03.0s), 1/1 VUs, 0 complete and 0 interrupted iterations
smoke   [  10% ] 1 VUs  03.0s/30s

running (0m04.0s), 1/1 VUs, 0 complete and 0 interrupted iterations
smoke   [  13% ] 1 VUs  04.0s/30s

running (0m05.0s), 1/1 VUs, 0 complete and 0 interrupted iterations
smoke   [  17% ] 1 VUs  05.0s/30s

running (0m06.0s), 1/1 VUs, 0 complete and 0 interrupted iterations
smoke   [  20% ] 1 VUs  06.0s/30s

running (0m07.0s), 1/1 VUs, 0 complete and 0 interrupted iterations
smoke   [  23% ] 1 VUs  07.0s/30s

running (0m08.0s), 1/1 VUs, 1 complete and 0 interrupted iterations
smoke   [  27% ] 1 VUs  08.0s/30s

running (0m09.0s), 1/1 VUs, 1 complete and 0 interrupted iterations
smoke   [  30% ] 1 VUs  09.0s/30s

running (0m10.0s), 1/1 VUs, 1 complete and 0 interrupted iterations
smoke   [  33% ] 1 VUs  10.0s/30s

running (0m11.0s), 1/1 VUs, 1 complete and 0 interrupted iterations
smoke   [  37% ] 1 VUs  11.0s/30s

running (0m12.0s), 1/1 VUs, 1 complete and 0 interrupted iterations
smoke   [  40% ] 1 VUs  12.0s/30s

running (0m13.0s), 1/1 VUs, 1 complete and 0 interrupted iterations
smoke   [  43% ] 1 VUs  13.0s/30s

running (0m14.0s), 1/1 VUs, 1 complete and 0 interrupted iterations
smoke   [  47% ] 1 VUs  14.0s/30s

running (0m15.0s), 1/1 VUs, 2 complete and 0 interrupted iterations
smoke   [  50% ] 1 VUs  15.0s/30s

running (0m16.0s), 1/1 VUs, 2 complete and 0 interrupted iterations
smoke   [  53% ] 1 VUs  16.0s/30s

running (0m17.0s), 1/1 VUs, 2 complete and 0 interrupted iterations
smoke   [  57% ] 1 VUs  17.0s/30s

running (0m18.0s), 1/1 VUs, 2 complete and 0 interrupted iterations
smoke   [  60% ] 1 VUs  18.0s/30s

running (0m19.0s), 1/1 VUs, 2 complete and 0 interrupted iterations
smoke   [  63% ] 1 VUs  19.0s/30s

running (0m20.0s), 1/1 VUs, 2 complete and 0 interrupted iterations
smoke   [  67% ] 1 VUs  20.0s/30s

running (0m21.0s), 1/1 VUs, 2 complete and 0 interrupted iterations
smoke   [  70% ] 1 VUs  21.0s/30s

running (0m22.0s), 1/1 VUs, 3 complete and 0 interrupted iterations
smoke   [  73% ] 1 VUs  22.0s/30s

running (0m23.0s), 1/1 VUs, 3 complete and 0 interrupted iterations
smoke   [  77% ] 1 VUs  23.0s/30s

running (0m24.0s), 1/1 VUs, 3 complete and 0 interrupted iterations
smoke   [  80% ] 1 VUs  24.0s/30s

running (0m25.0s), 1/1 VUs, 4 complete and 0 interrupted iterations
smoke   [  83% ] 1 VUs  25.0s/30s

running (0m26.0s), 1/1 VUs, 4 complete and 0 interrupted iterations
smoke   [  87% ] 1 VUs  26.0s/30s

running (0m27.0s), 1/1 VUs, 4 complete and 0 interrupted iterations
smoke   [  90% ] 1 VUs  27.0s/30s

running (0m28.0s), 1/1 VUs, 4 complete and 0 interrupted iterations
smoke   [  93% ] 1 VUs  28.0s/30s

running (0m29.0s), 1/1 VUs, 5 complete and 0 interrupted iterations
smoke   [  97% ] 1 VUs  29.0s/30s

running (0m30.0s), 1/1 VUs, 5 complete and 0 interrupted iterations
smoke   [ 100% ] 1 VUs  30.0s/30s
time="2026-04-10T10:37:52Z" level=info msg="\n============================================================" source=console
time="2026-04-10T10:37:52Z" level=info msg="Test complete — Scenario: smoke" source=console
time="2026-04-10T10:37:52Z" level=info msg="Target: https://35.244.162.92.nip.io" source=console
time="2026-04-10T10:37:52Z" level=info msg="Circuit breaker trips detected: check circuit_breaker_trips metric" source=console
time="2026-04-10T10:37:52Z" level=info msg="============================================================\n" source=console

     █ auth: register

       ✓ register: status 201 or 409

     █ auth: get profile

       ✓ profile: status 200
       ✓ profile: has email

     █ map: search places

       ✓ search: status 200 or 429

     █ map: get route

       ✓ route: status 200

     █ capacity: check availability

       ✓ segments: status 200
       ✓ segments: is array

     █ capacity: occupancy

       ✓ occupancy: status 200

     █ journey: create

       ✓ journey create: status 201/200/409/422
       ✓ journey create: not 5xx (except 503)

   ✓ auth_success...................: 100.00% ✓ 6        ✗ 0  
   ✓ capacity_check_duration........: avg=172.66ms min=15ms     med=231ms    max=272ms    p(90)=263.8ms  p(95)=267.89ms
     checks.........................: 100.00% ✓ 45       ✗ 0  
     data_received..................: 299 kB  9.8 kB/s
     data_sent......................: 12 kB   394 B/s
     group_duration.................: avg=316.06ms min=10.22ms  med=261.61ms max=1.15s    p(90)=741.01ms p(95)=844.23ms
     http_req_blocked...............: avg=393.11µs min=382ns    med=618ns    max=7.38ms   p(90)=858ns    p(95)=2.08ms  
     http_req_connecting............: avg=27.86µs  min=0s       med=0s       max=498.93µs p(90)=0s       p(95)=156.91µs
   ✓ http_req_duration..............: avg=305.95ms min=5.34ms   med=252.24ms max=1.14s    p(90)=740.37ms p(95)=832.6ms 
       { expected_response:true }...: avg=305.95ms min=5.34ms   med=252.24ms max=1.14s    p(90)=740.37ms p(95)=832.6ms 
   ✓ http_req_failed................: 0.00%   ✓ 0        ✗ 34 
     http_req_receiving.............: avg=79.33ms  min=87.9µs   med=162.24µs max=716.28ms p(90)=249.95ms p(95)=345.61ms
     http_req_sending...............: avg=128.11µs min=65.81µs  med=117.44µs max=269.95µs p(90)=180.29µs p(95)=209.49µs
     http_req_tls_handshaking.......: avg=315µs    min=0s       med=0s       max=5.46ms   p(90)=0s       p(95)=1.83ms  
     http_req_waiting...............: avg=226.49ms min=5ms      med=37.53ms  max=1.09s    p(90)=540.63ms p(95)=738.82ms
     http_reqs......................: 34      1.116236/s
     iteration_duration.............: avg=3.8s     min=164.62µs med=3.38s    max=7.52s    p(90)=7.31s    p(95)=7.41s   
     iterations.....................: 6       0.196983/s
   ✓ journey_create_success.........: 100.00% ✓ 3        ✗ 0  
   ✓ route_compute_duration.........: avg=621.66ms min=190ms    med=644.5ms  max=978ms    p(90)=866.5ms  p(95)=922.25ms
     vus............................: 1       min=1      max=1
     vus_max........................: 1       min=1      max=1


running (0m30.5s), 0/1 VUs, 6 complete and 0 interrupted iterations
smoke ✓ [ 100% ] 1 VUs  30s

LOAD TEST PASSED — All thresholds met
[k6] Summary written to: /home/ajinkyataranekar26/distributed-vehicle-capacity-system/scripts/load-testing/results/summary-smoke-20260410T103722.json